In [1]:
import pandas as pd

In [2]:
data = {
    "Name":["Anna","Karen","John","Alice","Kevin","Bob","Samm","Emily"],
    "Age":[35,30,57,65,25,19,28,65],
    "Salary":[20000,60000,145000,170000,30000,10000,220000,120000],
    "Department":["Tech","Tech","Tech","HealthCare","Operations","Operations","Tech","Tech"]
    }
df = pd.DataFrame(data)
df

    Name  Age  Salary  Department
0   Anna   35   20000        Tech
1  Karen   30   60000        Tech
2   John   57  145000        Tech
3  Alice   65  170000  HealthCare
4  Kevin   25   30000  Operations
5    Bob   19   10000  Operations
6   Samm   28  220000        Tech
7  Emily   65  120000        Tech

In [3]:
#sort data in ascending order
df.sort_values(by='Salary',ascending=True)

    Name  Age  Salary  Department
5    Bob   19   10000  Operations
0   Anna   35   20000        Tech
4  Kevin   25   30000  Operations
1  Karen   30   60000        Tech
7  Emily   65  120000        Tech
2   John   57  145000        Tech
3  Alice   65  170000  HealthCare
6   Samm   28  220000        Tech

In [4]:
#sorting data in descending order
df.sort_values(by='Salary',ascending=False)

    Name  Age  Salary  Department
6   Samm   28  220000        Tech
3  Alice   65  170000  HealthCare
2   John   57  145000        Tech
7  Emily   65  120000        Tech
1  Karen   30   60000        Tech
4  Kevin   25   30000  Operations
0   Anna   35   20000        Tech
5    Bob   19   10000  Operations

Grouping data

In [5]:
#grouping by department and counting how many are in each department per column
df.groupby('Department').count()

            Name  Age  Salary
Department
HealthCare     1    1       1
Operations     2    2       2
Tech           5    5       5

In [6]:
#grouping by department but counting names in each department
df.groupby('Department')['Name'].count()

Department
HealthCare    1
Operations    2
Tech          5
Name: Name, dtype: int64

In [7]:
#grouping by department and average salary per department
df.groupby('Department')['Salary'].mean()

Department
HealthCare    170000.0
Operations     20000.0
Tech          113000.0
Name: Salary, dtype: float64

In [8]:
#calculating mininum salary for each department
df.groupby('Department')['Salary'].min()

Department
HealthCare    170000
Operations     10000
Tech           20000
Name: Salary, dtype: int64

In [9]:
#calculating the maximum salary for each department
df.groupby('Department')['Salary'].max()

Department
HealthCare    170000
Operations     30000
Tech          220000
Name: Salary, dtype: int64

In [10]:
#calculate the average age per department
df.groupby('Department')['Age'].mean()

Department
HealthCare    65.0
Operations    22.0
Tech          43.0
Name: Age, dtype: float64

In [11]:
#calcuate maximum age per department
df.groupby('Department')['Age'].max()

Department
HealthCare    65
Operations    25
Tech          65
Name: Age, dtype: int64

In [12]:
#calculate the minimum age per department
df.groupby('Department')['Age'].min()

Department
HealthCare    65
Operations    19
Tech          28
Name: Age, dtype: int64

Filtering Data

In [13]:
#filter out data whose salary is greater than 100000
df[df['Salary'] > 100000]

    Name  Age  Salary  Department
2   John   57  145000        Tech
3  Alice   65  170000  HealthCare
6   Samm   28  220000        Tech
7  Emily   65  120000        Tech

In [14]:
#filter out data whose salary is greater than 100000 but less than 200000

df[(df['Salary'] > 100000) & (df['Salary'] < 200000)]

    Name  Age  Salary  Department
2   John   57  145000        Tech
3  Alice   65  170000  HealthCare
7  Emily   65  120000        Tech

In [15]:

df[df['Age'].isin([25,65])]

    Name  Age  Salary  Department
3  Alice   65  170000  HealthCare
4  Kevin   25   30000  Operations
7  Emily   65  120000        Tech